<a href="https://colab.research.google.com/github/Smarth2005/UCS420-Cognitive-Computing-Lab-Assignments/blob/main/Python%20Basic%20Libraries%3A%20Hands-On%20Implementation/L2.%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas in Action: Simplifying Data Handling and Analysis

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Playing with Dataframe
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index = ['Row 1','Row 2','Row 3','Row 4','Row 5'], columns = ["Column 1", "Column 2", "Column 3", "Column 4"])

In [ ]:
df.head()

       Column 1  Column 2  Column 3  Column 4
Row 1         0         1         2         3
Row 2         4         5         6         7
Row 3         8         9        10        11
Row 4        12        13        14        15
Row 5        16        17        18        19

In [ ]:
df.to_csv('Test1.csv')

In [ ]:
# Accessing the elements
# 1. .loc    2. .iloc

df.loc['Row 1']

Column 1    0
Column 2    1
Column 3    2
Column 4    3
Name: Row 1, dtype: int32

In [ ]:
type(df.loc['Row 1'])

pandas.core.series.Series

In [ ]:
df.iloc[:,:]

       Column 1  Column 2  Column 3  Column 4
Row 1         0         1         2         3
Row 2         4         5         6         7
Row 3         8         9        10        11
Row 4        12        13        14        15
Row 5        16        17        18        19

In [ ]:
df.iloc[0:2,0:2]

       Column 1  Column 2
Row 1         0         1
Row 2         4         5

In [ ]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[0:2,0:1]

       Column 1
Row 1         0
Row 2         4

In [ ]:
type(df.iloc[0:2,0:1])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[:,1:]

       Column 2  Column 3  Column 4
Row 1         1         2         3
Row 2         5         6         7
Row 3         9        10        11
Row 4        13        14        15
Row 5        17        18        19

In [ ]:
# convert dataframes into arrays
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [ ]:
df.iloc[:,1:].values.shape

(5, 3)

In [ ]:
df.isnull().sum()

Column 1    0
Column 2    0
Column 3    0
Column 4    0
dtype: int64

In [ ]:
df['Column 1'].value_counts()

Column 1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [ ]:
df['Column 1'].unique()

array([ 0,  4,  8, 12, 16])

In [ ]:
df[['Column 2','Column 3']]

       Column 2  Column 3
Row 1         1         2
Row 2         5         6
Row 3         9        10
Row 4        13        14
Row 5        17        18

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv('diabetes.csv')

In [ ]:
df.head() # head() gives you top 5 records

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [ ]:
df.describe() # only the integer and floating point columns are taken into consideration, object columns are not taken.

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [ ]:
#Get the unique category counts
df['Pregnancies'].value_counts()

Pregnancies
1     135
0     111
2     103
3      75
4      68
5      57
6      50
7      45
8      38
9      28
10     24
11     11
13     10
12      9
14      2
15      1
17      1
Name: count, dtype: int64

In [ ]:
df[df['Glucose']>100]

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
2,8,183,64,0,0,23.3,0.672,32,1
4,0,137,40,35,168,43.1,2.288,33,1
5,5,116,74,0,0,25.6,0.201,30,0
7,10,115,0,0,0,35.3,0.134,29,0
...,...,...,...,...,...,...,...,...,...
761,9,170,74,31,0,44.0,0.403,43,1
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1

# CSV

In [ ]:
from io import StringIO, BytesIO

In [ ]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3')

In [ ]:
type(data)

str

In [ ]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [ ]:
## Read from specific columns
df = pd.read_csv(StringIO(data), usecols = lambda x: x.upper() in ['COL1','COL3'])

In [ ]:
df.head()

  col1  col3
0    x     1
1    a     2
2    c     3

In [ ]:
df = pd.read_csv(StringIO(data), usecols = ['col1','col3'])

In [ ]:
df.head()

  col1  col3
0    x     1
1    a     2
2    c     3

In [ ]:
## Specifying column data types
data = ('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11,12')

In [ ]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [ ]:
df = pd.read_csv(StringIO(data), dtype = object)

In [ ]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [ ]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [ ]:
df['a'][1]

'5'

In [ ]:
df = pd.read_csv(StringIO(data), dtype = int)

In [ ]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [ ]:
df['a'][2]

9

In [ ]:
type(df['a'][2])

numpy.int32

In [ ]:
df = pd.read_csv(StringIO(data), dtype = float)

In [ ]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [ ]:
type(df['a'][2])

numpy.float64

In [ ]:
df = pd.read_csv(StringIO(data), dtype = {'b': float, 'c': int, 'a': 'Int32' })

In [ ]:
df

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [ ]:
## Check the datatypes
df.dtypes

a      Int32
b    float64
c      int32
d      int64
dtype: object

In [ ]:
data = ('index,a,b,c\n'
        '4,apple,bat,5.7\n'
        '8,orange,cow,10')

In [ ]:
df = pd.read_csv(StringIO(data))

In [ ]:
df

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [ ]:
df = pd.read_csv(StringIO(data), index_col = 0)

In [ ]:
df

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [ ]:
data = ('a,b,c\n'
        '4,apple,bat\n'
        '8,orange,cow')

In [ ]:
df = pd.read_csv(StringIO(data))

In [ ]:
df

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [ ]:
pd.read_csv(StringIO(data))

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [ ]:
pd.read_csv(StringIO(data),index_col = False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [ ]:
data = ('a,b,c,\n'
        '4,apple,bat,\n'
        '8,orange,cow,')

In [ ]:
pd.read_csv(StringIO(data))

   a       b    c  Unnamed: 3
0  4   apple  bat         NaN
1  8  orange  cow         NaN

In [ ]:
pd.read_csv(StringIO(data), usecols = ['b','c'], index_col = False)

        b    c
0   apple  bat
1  orange  cow

In [ ]:
## Quoting and escape characters [Very useful in NLP]
data = 'a,b\n"Hello, \\"Bob\\", nice to see you.",5'

In [ ]:
pd.read_csv(StringIO(data),escapechar = '\\')

                                a  b
0  Hello, "Bob", nice to see you.  5

In [ ]:
## URL to CSV